docs/state_machines/dot/en/core/project_access_state_Project_member.dot
digraph {
  rankdir=LR;
  node [shape=oval];
  edge [fontsize=10];

  invited [label="did not confirm project membership"];
  engaged [label="confirmed project membership"];
  unsured [label="no certified surety"];
  allowed [label="allowed"];
  denied [label="denied"];
  suspended [label="suspended"];
  __initial [shape=point];
  __initial -> invited;
  invited -> engaged [label="accept_invitation"];
  engaged -> unsured [label="append_to_surety"];
  allowed -> engaged [label="substract_from_surety"];
  unsured -> engaged [label="substract_from_surety"];
  denied -> engaged [label="substract_from_surety"];
  suspended -> engaged [label="substract_from_surety"];
  unsured -> allowed [label="activate"];
  suspended -> allowed [label="activate"];
  allowed -> denied [label="deny"];
  denied -> allowed [label="allow"];
  allowed -> suspended [label="suspend"];
}
